IRP/src/Enums/MetadataTypes/MetadataTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>MetadataTypes</name>
 <enumValues>
  <name>AccountingRegister</name>
 </enumValues>
 <enumValues>
  <name>AccumulationRegister</name>
 </enumValues>
 <enumValues>
  <name>BusinessProcess</name>
 </enumValues>
 <enumValues>
  <name>CalculationRegister</name>
 </enumValues>
 <enumValues>
  <name>Catalog</name>
 </enumValues>
 <enumValues>
  <name>ChartOfAccounts</name>
 </enumValues>
 <enumValues>
  <name>ChartOfCalculationTypes</name>
 </enumValues>
 <enumValues>
  <name>ChartOfCharacteristicTypes</name>
 </enumValues>
 <enumValues>
  <name>CommonAttribute</name>
 </enumValues>
 <enumValues>
  <name>CommonCommand</name>
 </enumValues>
 <enumValues>
  <name>CommonForm</name>
 </enumValues>
 <enumValues>
  <name>Configuration</name>
 </enumValues>
 <enumValues>
  <name>Constant</name>
 </enumValues>
 <enumValues>
  <name>DataProcessor</name>
 </enumValues>
 <enumValues>
  <name>Document</name>
 </enumValues>
 <enumValues>
  <name>DocumentJournal</name>
 </enumValues>
 <enumValues>
  <name>Enum</name>
 </enumValues>
 <enumValues>
  <name>ExchangePlan</name>
 </enumValues>
 <enumValues>
  <name>ExternalDataSource</name>
 </enumValues>
 <enumValues>
  <name>FilterCriterion</name>
 </enumValues>
 <enumValues>
  <name>HTTPService</name>
 </enumValues>
 <enumValues>
  <name>InformationRegister</name>
 </enumValues>
 <enumValues>
  <name>IntegrationService</name>
 </enumValues>
 <enumValues>
  <name>Report</name>
 </enumValues>
 <enumValues>
  <name>Role</name>
 </enumValues>
 <enumValues>
  <name>Sequence</name>
 </enumValues>
 <enumValues>
  <name>SessionParameter</name>
 </enumValues>
 <enumValues>
  <name>Subsystem</name>
 </enumValues>
 <enumValues>
  <name>Task</name>
 </enumValues>
 <enumValues>
  <name>WebService</name>
 </enumValues>
 <enumValues>
  <name>Interface</name>
 </enumValues>
 <enumValues>
  <name>Language</name>
 </enumValues>
</mdclass:Enum>

IRP/src/Enums/MetadataSubtype/MetadataSubtype.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>MetadataSubtype</name>
  <enumValues>
    <name>Attribute</name>
  </enumValues>
  <enumValues>
    <name>Dimension</name>
  </enumValues>
  <enumValues>
    <name>Resource</name>
  </enumValues>
  <enumValues>
    <name>StandardAttribute</name>
  </enumValues>
  <enumValues>
    <name>Command</name>
  </enumValues>
  <enumValues>
    <name>Recalculation</name>
  </enumValues>
  <enumValues>
    <name>AccountingFlag</name>
  </enumValues>
  <enumValues>
    <name>ExtDimensionAccountingFlag</name>
  </enumValues>
  <enumValues>
    <name>AddressingAttribute</name>
  </enumValues>
  <enumValues>
    <name>TabularSection</name>
  </enumValues>
  <enumValues>
    <name>StandardTabularSection</name>
  </enumValues>
  <enumValues>
    <name>Operation</name>
  </enumValues>
  <enumValues>
    <name>URLTemplate</name>
  </enumValues>
  <enumValues>
    <name>Method</name>
  </enumValues>
  <enumValues>
    <name>Cube</name>
  </enumValues>
  <enumValues>
    <name>Table</name>
  </enumValues>
  <enumValues>
    <name>DimensionTable</name>
  </enumValues>
  <enumValues>
    <name>Function</name>
  </enumValues>
  <enumValues>
    <name>Field</name>
  </enumValues>
</mdclass:Enum>

IRP/src/CommonModules/MetadataInfo/Module.bsl
#Region Internal

Function hasAttributes(MetaName) Export
	Array = New Array();
	Array.Add(Enums.MetadataTypes.Catalog);
	Array.Add(Enums.MetadataTypes.Document);
	Array.Add(Enums.MetadataTypes.Task);
	Array.Add(Enums.MetadataTypes.DataProcessor);
	Array.Add(Enums.MetadataTypes.Report);
	Array.Add(Enums.MetadataTypes.ChartOfCalculationTypes);
	Array.Add(Enums.MetadataTypes.ChartOfCharacteristicTypes);
	Array.Add(Enums.MetadataTypes.ExchangePlan);
	Array.Add(Enums.MetadataTypes.ChartOfAccounts);
	Array.Add(Enums.MetadataTypes.AccountingRegister);
	Array.Add(Enums.MetadataTypes.AccumulationRegister);
	Array.Add(Enums.MetadataTypes.CalculationRegister);
	Array.Add(Enums.MetadataTypes.InformationRegister);
	Array.Add(Enums.MetadataTypes.BusinessProcess);

	Return Not Array.Find(MetaName) = Undefined;
EndFunction

Function hasDimensions(MetaName) Export
	Array = New Array();
	Array.Add(Enums.MetadataTypes.AccountingRegister);
	Array.Add(Enums.MetadataTypes.AccumulationRegister);
	Array.Add(Enums.MetadataTypes.CalculationRegister);
	Array.Add(Enums.MetadataTypes.InformationRegister);
	Array.Add(Enums.MetadataTypes.Sequence);
	Array.Add(Enums.MetadataSubtype.Cube);

	Return Not Array.Find(MetaName) = Undefined;
EndFunction

Function hasStandardAttributes(MetaName) Export
	Array = New Array();
	Array.Add(Enums.MetadataTypes.Catalog);
	Array.Add(Enums.MetadataTypes.Document);
	Array.Add(Enums.MetadataTypes.DocumentJournal);
	Array.Add(Enums.MetadataTypes.Task);
	Array.Add(Enums.MetadataTypes.ChartOfCalculationTypes);
	Array.Add(Enums.MetadataTypes.ChartOfCharacteristicTypes);
	Array.Add(Enums.MetadataTypes.ExchangePlan);
	Array.Add(Enums.MetadataTypes.ChartOfAccounts);
	Array.Add(Enums.MetadataTypes.AccountingRegister);
	Array.Add(Enums.MetadataTypes.AccumulationRegister);
	Array.Add(Enums.MetadataTypes.CalculationRegister);
	Array.Add(Enums.MetadataTypes.InformationRegister);
	Array.Add(Enums.MetadataTypes.BusinessProcess);
	Return Not Array.Find(MetaName) = Undefined;
EndFunction

Function hasRecalculations(MetaName) Export
	Array = New Array();
	Array.Add(Enums.MetadataTypes.CalculationRegister);
	Return Not Array.Find(MetaName) = Undefined;
EndFunction

Function hasAccountingFlags(MetaName) Export
	Array = New Array();
	Array.Add(Enums.MetadataTypes.ChartOfAccounts);
	Return Not Array.Find(MetaName) = Undefined;
EndFunction

Function EnumNameByRef(RefData) Export
	RefNameType = RefData.Metadata().Name;
	ValueIndex = Enums[RefNameType].IndexOf(RefData);
	Return Metadata.Enums[RefNameType].EnumValues[ValueIndex].Name;
EndFunction

#EndRegion
